coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/source/tmpm369_cg.c
    tmp &= CG_OSCCR_WRITE0_MASK;   /* CGOSCCR bit 13, 12, 7, 6 write "0" */
    tmp |= CG_OSCCR_WRITE1_MASK;   /* CGOSCCR bit 5, 4 write "1" */
    TSB_CG->OSCCR = tmp;
}

/**
  * @brief  Disable supplying fc for USBD, USBH, CAN and EtherMac.
  * @param  Periph: The target peripheral that CG supplies fc for
  *   This parameter can be one of the following values:
  *   CG_USBD_CLK_SUPPLY: USBD clock control
  *   CG_USBH_CLK_SUPPLY: USBH clock control
  *   CG_CAN_CLK_SUPPLY: CAN clock control
  *   CG_ETHER_MAC_CLK_SUPPLY: EtherMac clock control
  * @retval None
  */
void CG_DisablePeriphClkSupply(uint32_t Periph)
{
    /* Check the parameters */
    assert_param(IS_CG_PERIPH_CLK_SUPPLY(Periph));
    
    TSB_CG->PCKSTP &= Periph;
}

/**
  * @brief  Enable or disable low-speed oscillator (fs) for RMC & OFD
  * @param  NewState: oscillator is enabled or disabled
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval None
  */
void CG_SetFs(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Enable low-speed oscillator */
        TSB_CG_OSCCR_XTEN = 1U;
    } else {
        /* Disable low-speed oscillator */
        TSB_CG_OSCCR_XTEN = 0U;
    }
}
/** @} */
/* End of group CG_Exported_Functions */

/** @} */
/* End of group CG */

/** @} */
/* End of group TX03_Periph_Driver */
#endif                          /* defined(__TMPM369_CG_H) */
